project/atropos-go/etcd_concurrent_read-master/PR/experient_1/with_expensive_read/expensive_read.log
bench with linearizable range
 0 / 10 B                                                                                                                                                              !   0.00%INFO: 2023/06/05 16:52:29 ccResolverWrapper: sending new addresses to cc: [{http://localhost:2379 0  <nil>}]
 10 / 10 Boooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo! 100.00% 9s

Summary:
  Total:	9.2238 secs.
  Slowest:	0.3008 secs.
  Fastest:	0.1939 secs.
  Average:	0.2275 secs.
  Stddev:	0.0276 secs.
  Requests/sec:	1.0841

Response time histogram:
  0.1939 [1]	|∎∎∎∎∎∎∎∎∎∎
  0.2046 [1]	|∎∎∎∎∎∎∎∎∎∎
  0.2153 [0]	|
  0.2259 [4]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.2366 [3]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.2473 [0]	|
  0.2580 [0]	|
  0.2687 [0]	|
  0.2794 [0]	|
  0.2901 [0]	|
  0.3008 [1]	|∎∎∎∎∎∎∎∎∎∎

Latency distribution:
  10% in 0.1981 secs.
  25% in 0.2189 secs.
  50% in 0.2247 secs.
  75% in 0.2362 secs.
  90% in 0.3008 secs.